In [46]:
import pandas as pd
import numpy as np

dataset = pd.read_csv('Meteorite_Landings.csv' )
dataset.head() # first 5 rows
# dataset.tail() # last 5 rows
# dataset.info() # summary of the DataFrame, including the number of non-null entries, data types, and memory usage.
# dataset.describe() # statistics for numerical columns
# dataset.sample(5) # random 5 rows

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [ ]:
# dataset.shape # number of rows and columns
# dataset.columns # column names    
# dataset.columns = dataset.columns.str.replace(' ', '_') # replace space with underscore
# dataset.columns = dataset.columns.str.lower() # lower case column names
# dataset.columns = dataset.columns.str.upper() # upper case column names
dataset['NAME'].value_counts() # count of unique values
# dataset

<bound method Series.max of NAME
Aachen                    1
Northwest Africa 7459     1
Northwest Africa 7404     1
Northwest Africa 7407     1
Northwest Africa 7408     1
                         ..
Grove Mountains 052250    1
Grove Mountains 052253    1
Grove Mountains 052254    1
Grove Mountains 052256    1
Zulu Queen                1
Name: count, Length: 45716, dtype: int64>

In [ ]:
# dataset.plot(kind='scatter', x='reclat', y='reclong', alpha=0.5) # scatter plot
dataset['year'].hist() # histogram
# dataset['year'].plot(kind='hist', bins=30) # histogram
# dataset['year'].plot(kind='box') # box plot
dataset.boxplot(column='year') # box plot

In [ ]:
dataset['year'].isnull() # check for missing values
dataset['year'].isnull().sum() # count of missing values
dataset['year'].isna().sum() # count of missing values

291

In [27]:
dataset.duplicated() # check for duplicates
dataset["GeoLocation"].duplicated().sum() # count of duplicates

28615

In [45]:


dataset.index = pd.Index(range(0,len(dataset)*3,3)) # set index
dataset.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775, 6.08333)"
3,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.18333, 10.23333)"
6,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.21667, -113.0)"
9,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.88333, -99.9)"
12,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.16667, -64.95)"